Revit 2027 API
RibbonItem.SetContextualHelp Method
Sets the contextual help bound with this button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetContextualHelp(
	ContextualHelp contextualHelp
)
Public Sub SetContextualHelp (
	contextualHelp As ContextualHelp
)
public:
void SetContextualHelp(
	ContextualHelp^ contextualHelp
)
member SetContextualHelp :
        contextualHelp : ContextualHelp -> unit
Parameters
contextualHelp ContextualHelp
The contextual help.
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace